dogs_app_backend/app/controllers/dogs_controller.rb

INSERT INTO "dogs" ("name", "description", "age", "washed", "exercised", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "test pup"], ["description", "lkajdsl;kfj"], ["age", 44], ["washed", 0], ["exercised", 0], ["created_at", "2024-02-22 21:46:30.265526"], ["updated_at", "2024-02-22 21:46:30.265526"]]
---
    def create
        @dog = Dog.create(dog_params)

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 8]]
---
    def destroy
        @dog = Dog.find(params[:id])
        @dog.destroy

UPDATE "dogs" SET "name" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["name", "Skylar was a dog in my childhood"], ["updated_at", "2024-02-22 21:33:40.905918"], ["id", 7]]
---
    def update
        # @dog = Dog.find(params[:id])
        @dog.update(dog_params)

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def find_dog
        @dog = Dog.find(params[:id])