dogs_app_backend/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.valid?
            @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Rachel123"], ["password_digest", "[FILTERED]"], ["created_at", "2024-02-23 00:16:39.353109"], ["updated_at", "2024-02-23 00:16:39.353109"]]